IRP/src/Catalogs/Agreements/Agreements.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Agreements</name>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartnerSegment</name>
    <type>
      <types>CatalogRef.PartnerSegments</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceType</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemSegment</name>
    <type>
      <types>CatalogRef.ItemSegments</types>
    </type>
  </attributes>
  <attributes>
    <name>StartUsing</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndOfUse</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ManagerSegment</name>
    <type>
      <types>CatalogRef.PartnerSegments</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceIncludeTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NumberDaysBeforeDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.AgreementTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </attributes>
  <attributes>
    <name>ApArPostingDetail</name>
    <type>
      <types>EnumRef.ApArPostingDetail</types>
    </type>
  </attributes>
  <attributes>
    <name>StandardAgreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <attributes>
    <name>Kind</name>
    <type>
      <types>EnumRef.AgreementKinds</types>
    </type>
  </attributes>
</mdclass:Catalog>

IRP/src/InformationRegisters/PartnerSegments/PartnerSegments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>PartnerSegments</name>
  <dimensions>
    <name>Segment</name>
    <type>
      <types>CatalogRef.PartnerSegments</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/Agreements/ManagerModule.bsl
Function GetRefsArrayByPartner(Parameter) Export
	Query = New Query;
	Query.Text = "SELECT ALLOWED
		|	PartnerSegments.Segment
		|INTO PartnerSegmentsTable
		|FROM
		|	InformationRegister.PartnerSegments AS PartnerSegments
		|WHERE
		|	PartnerSegments.Partner = &Partner
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT ALLOWED
		|	Agreements.Ref
		|FROM
		|	Catalog.Agreements AS Agreements
		|		LEFT JOIN PartnerSegmentsTable AS PartnerSegmentsTable
		|		ON Agreements.PartnerSegment = PartnerSegmentsTable.Segment
		|WHERE
		|	Agreements.Partner = &Partner
		|	OR ISNULL(PartnerSegmentsTable.Segment,
		|		VALUE(Catalog.PartnerSegments.EmptyRef)) <> VALUE(Catalog.PartnerSegments.EmptyRef)
		|GROUP BY
		|	Agreements.Ref
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|DROP PartnerSegmentsTable";
	Query.SetParameter("Partner", Parameter);
	QueryExecute = Query.Execute();
	If QueryExecute.IsEmpty() Then
		ReturnValue = New Array;
	Else
		QueryResult = QueryExecute.Unload();
		ReturnValue = QueryResult.UnloadColumn("Ref");
	EndIf;
	Return ReturnValue;
EndFunction

Function GetRefsArrayBySegment(Parameter) Export
	Query = New Query;
	Query.Text = "SELECT ALLOWED
		|	PartnerSegments.Segment
		|INTO PartnerSegmentsTable
		|FROM
		|	InformationRegister.PartnerSegments AS PartnerSegments
		|WHERE
		|	PartnerSegments.Segment = &Segment
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT ALLOWED
		|	Agreements.Ref
		|FROM
		|	Catalog.Agreements AS Agreements
		|		INNER JOIN PartnerSegmentsTable AS PartnerSegmentsTable
		|		ON Agreements.PartnerSegment = PartnerSegmentsTable.Segment
		|WHERE
		|	ISNULL(Agreements.Ref, VALUE(Catalog.Agreements.EmptyRef)) <> VALUE(Catalog.Agreements.EmptyRef)
		|GROUP BY
		|	Agreements.Ref
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|DROP PartnerSegmentsTable";
	Query.SetParameter("Segment", Parameter);
	QueryExecute = Query.Execute();
	If QueryExecute.IsEmpty() Then
		ReturnValue = New Array;
	Else
		QueryResult = QueryExecute.Unload();
		ReturnValue = QueryResult.UnloadColumn("Ref");
	EndIf;
	Return ReturnValue;
EndFunction

Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	
	If TypeOf(Parameters) <> Type("Structure")
		Or Not ValueIsFilled(Parameters.SearchString)
		Or Not Parameters.Filter.Property("AdditionalParameters") Then
		Return;
	EndIf;
	
	StandardProcessing = False;
	
	QueryTable = GetChoiseDataTable(Parameters);
	ChoiceData = New ValueList();
	For Each Row In QueryTable Do
		ChoiceData.Add(Row.Ref, Row.Presentation);
	EndDo;
EndProcedure

Function GetChoiseDataTable(Parameters) Export
	
	QueryBuilderText =
		"SELECT ALLOWED TOP 50
		|	Table.Ref AS Ref,
		|	Table.Presentation
		|FROM
		|	Catalog.Agreements AS Table
		|WHERE
		|	Table.Description_en LIKE ""%%"" + &SearchString + ""%%""
		|	AND (CASE
		|		WHEN &IncludeFilterByPartner
		|			THEN Table.Partner = &Partner
		|			OR &IncludePartnerSegments
		|			AND Table.PartnerSegment IN (&PartnerSegments)
		|		ELSE TRUE
		|	END
		|	AND CASE
		|		WHEN &IncludeFilterByEndOfUseDate
		|			THEN Table.StartUsing <= &EndOfUseDate
		|			AND (Table.EndOfUse >= &EndOfUseDate
		|			OR Table.EndOfUse = DATETIME(1, 1, 1))
		|		ELSE TRUE
		|	END)";
	QueryBuilderText = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(QueryBuilderText);
	
	QueryBuilder = New QueryBuilder(QueryBuilderText);
	QueryBuilder.FillSettings();
	If TypeOf(Parameters) = Type("Structure")
		And Parameters.Filter.Property("CustomSearchFilter") Then
		ArrayOfFilters = CommonFunctionsServer.DeserializeXMLUseXDTO(Parameters.Filter.CustomSearchFilter);
		For Each Filter In ArrayOfFilters Do
			NewFilter = QueryBuilder.Filter.Add("Ref." + Filter.FieldName);
			NewFilter.Use = True;
			NewFilter.ComparisonType = Filter.ComparisonType;
			NewFilter.Value = Filter.Value;
		EndDo;
	EndIf;
	Query = QueryBuilder.GetQuery();
	
	Query.SetParameter("SearchString", Parameters.SearchString);
	
	QueryParametersStr = New Structure();
	QueryParametersStr.Insert("IncludeFilterByEndOfUseDate", False);
	QueryParametersStr.Insert("IncludeFilterByPartner"     , False);
	QueryParametersStr.Insert("IncludePartnerSegments"     , False);
	QueryParametersStr.Insert("EndOfUseDate"               , Date(1, 1, 1));
	QueryParametersStr.Insert("Partner"                    , Undefined);
	QueryParametersStr.Insert("PartnerSegments"            , New Array);

	AdditionalParameters = CommonFunctionsServer.DeserializeXMLUseXDTO(Parameters.Filter.AdditionalParameters);
	For Each QueryParameter In QueryParametersStr Do
		Query.SetParameter(QueryParameter.Key, ?(AdditionalParameters.Property(QueryParameter.Key),
				AdditionalParameters[QueryParameter.Key],
				QueryParameter.Value));
	EndDo;
	If Query.Parameters.IncludePartnerSegments Then
		PartnersSegmentsArray = InformationRegisters.PartnerSegments.GetSegmentsRefArrayByPartner(Query.Parameters.Partner);
		Query.SetParameter("PartnerSegments", PartnersSegmentsArray);
	EndIf;
	Return Query.Execute().Unload();
EndFunction

Function GetDefaultChoiseRef(Parameters) Export
	QueryTable = GetChoiseDataTable(New Structure("SearchString, Filter", "", Parameters));
	
	If QueryTable.Count() = 1 Then
		Return QueryTable[0].Ref;
	Else 
		If Parameters.Property("Agreement") Then
			Rows = QueryTable.FindRows(New Structure("Ref", Parameters.Agreement));
			If Rows.Count() = 0 Then
				Return PredefinedValue("Catalog.Agreements.EmptyRef");
			Else
				Return Parameters.Agreement;
			EndIf;
		Else
			Return PredefinedValue("Catalog.Agreements.EmptyRef");
		EndIf;
	EndIf;
	
EndFunction

Function GetAgreementInfo(Agreement) Export
	Query = New Query();
	Query.Text = 
	"SELECT ALLOWED TOP 1
	|	DATEADD(&CurrentDate, DAY, Table.NumberDaysBeforeDelivery) AS DateOfShipment,
	|	DATEADD(&CurrentDate, DAY, Table.NumberDaysBeforeDelivery) AS DeliveryDate,
	|	Table.Ref AS Ref,
	|	Table.Store AS Store,
	|	Table.PriceIncludeTax AS PriceIncludeTax,
	|	Table.Company AS Company,
	|	Table.PriceType AS PriceType,
	|	Table.Partner AS Partner,
	|	Table.Type AS Type,
	|	Table.CurrencyMovementType.Currency AS Currency,
	|	Table.CurrencyMovementType.Source AS Source,
	|	Table.CurrencyMovementType AS CurrencyMovementType,
	|	Table.ApArPostingDetail
	|FROM
	|	Catalog.Agreements AS Table
	|WHERE
	|	Table.Ref = &Ref";
	Query.SetParameter("Ref", Agreement);
	Query.SetParameter("CurrentDate", CurrentDate());
	QueryResult = Query.Execute();
	
	Result = New Structure();
	For Each Column In QueryResult.Columns Do
		Result.Insert(Column.Name);
	EndDo;
	
	Selection = QueryResult.Select();
	If Selection.Next() Then
		FillPropertyValues(Result, Selection);
	EndIf;
	Return Result;
EndFunction
